# -*- coding: utf-8 -*-
import pandas as pd

pd.set_option('display.max_columns', None)   # 显示完整的列
pd.set_option('display.max_rows', None)  # 显示完整的行
pd.set_option('display.expand_frame_repr', False)  # 设置不折叠数据

students = [ ('jack', 34, 'Sydeny') ,
             ('Riti', 30, 'Delhi' ) ,
             ('Aadi', 16, 'New York') ]

students2 = [('00005D6A3720003EE0530AF680F1B768', 'SQ-1180201408001575', '005', '004', 'SQ-1180201408001575', 0, '00491607', '张丽娟', '20020841', '胜利社保中心', '', '', '', '8118290156', '胜利分公司社保中心', '1180', '', '9118200000', '胜利油田分公司本部', '20140807', '20020841', '20020841', '胜利社保中心', '20020800', '20020800', '分公司机关', '', '', '', '', 'RMB', 'RMB', '人民币', 0.0, '', '', '', '', 'RMB', 'RMB', 2680.0, 0.0, 0.0, '', '', '0', 0.0, '0', 'FSS00503', '', '004', '', '', '00491607', '', '2014-08-07 08:46:54.819', '00491607', '2014-08-07 08:46:54.819', 0.0, '0', '人力资源和社会保障部教育培训中心培训班', '20020841', '', '人民币', '00491607', '20140704', '20140808', '', '', '', '', '张丽娟', '00491607', '', '', '', '', '', '0', '', '', '', '', '2014-08-07 00:00:00.000', '', '', 'ZFYBXERS00', '20210809'), ('0000C0744CF00112E0530AF680F1959B', 'SQ-1180201408001585', '005', '004', 'SQ-1180201408001585', 0, '00491573', '向青', '20020841', '胜利社保中心', '', '', '', '8118290156', '胜利分公司社保中心', '1180', '', '9118200000', '胜利油田分公司本部', '20140807', '20020841', '20020841', '胜利社保中心', '20020800', '20020800', '分公司机关', '', '', '', '', 'RMB', 'RMB', '人民币', 0.0, '', '', '', '', 'RMB', 'RMB', 500.0, 0.0, 0.0, '', '', '0', 0.0, '0', 'FSS00503', '', '004', '', '', '00491573', '', '2014-08-07 09:14:17.568', '00491573', '2014-08-07 09:14:17.568', 0.0, '0', '经办业务会议', '20020841', '', '人民币', '00491573', '20140727', '20140729', '', '', '', '', '向青', '00491573', '', '', '', '', '', '0', '', '', '', '', '2014-08-07 00:00:00.000', '', '', 'ZFYBXERS00', '20210809'), ('0000C980718903E6E0530AF680F16511', 'SQ-3500201408000811', '007', '004', 'SQ-3500201408000811', 0, '03144643', '汪涵瀚', '20035017', '审计处', '', '', '', '8350001117', '省司审计处', '3500', '', '9350001100', '中国石油化工股份有限公司广东石油分公司本部', '20140807', '20035017', '20035017', '审计处', '20035002', '20035002', '中国石油化工股份有限公司广东石油分公司管理机关', '', '', '', '', '', '', '', 0.0, '', '', '', '', 'RMB', 'RMB', 1362.0, 0.0, 0.0, '', '', '0', 0.0, '0', 'FSS00703', '', '004', '', '', '03144643', '', '2014-08-07 09:29:14.497', '03144643', '2014-08-07 09:29:14.497', 0.0, '0', '审计处申请业务招待费，与审计局总部领导进行业务沟通交流', '20035017', '', '人民币', '03144643', '', '', '', '', '', '', '汪涵瀚', '03144643', '', '', '', '', '', '0', '', '', '', '', '2014-08-07 00:00:00.000', '', '', 'ZFYBXERS00', '20210809')]

inp1 = [{'c1':10, 'c2':100}, {'c1':11, 'c2':110}, {'c1':12, 'c2':123}]
df1 = pd.DataFrame(inp1)

inp2 = [{'c1':20, 'c2':200}, {'c1':21, 'c2':210}, {'c1':12, 'c2':123}]
df2 = pd.DataFrame(inp2)
# 两个 dataframe 合并
df = df1.append(df2, ignore_index=True)

print(df.shape)

print('---------' * 3 )
inner_pd = pd.merge(df1, df2, on=['c1', 'c2'] ,how='inner')
print(inner_pd)

print('---------' * 3 )

for row in df.itertuples():
    #print(row.c1, row.c2 , type(row), row )
    #print(row)
    is_same = False

    for inner_row in inner_pd.itertuples():
        if row.c1 == inner_row.c1 and row.c2 == inner_row.c2:
            is_same = True
            #print(inner_row)
            break
    #print(is_same)
    if not is_same:
        print(row.c1, row.c2 , type(row), row )

for row in inner_pd.itertuples():
    print(row.c1, row.c2 , type(row), row )